Revit 2024 API
RebarBendingDetail.SetHost Method
 Sets the reinforcement element that will be represented by the input bending detail.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static void SetHost(
	Element bendingDetail,
	Reference reference
)
Visual Basic
Public Shared Sub SetHost ( _
	bendingDetail As Element, _
	reference As Reference _
)
Visual C++
public:
static void SetHost(
	Element^ bendingDetail,
	Reference^ reference
)
Parameters
bendingDetail
Type: Autodesk.Revit.DB.Element
 The bending detail for which we want to set the host.
reference
Type: Autodesk.Revit.DB.Reference
 Reference pointing to the reinforcement element that will be represented by the input bending detail.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace